---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.BuiltInFailures.RenderFailures
source: html/d3ec215f-5833-0bc7-51e6-392ed707ee87.htm
---
# BuiltInFailures.RenderFailures Members

Provides a container of all Revit built-in FailureDefinitionId instances.